payfc/app/controllers/users_controller.rb

SELECT  "users".* FROM "users" WHERE "users"."userid" = ? LIMIT 1  [["userid", 1000]]
UPDATE "users" SET "money" = ?, "updated_at" = ? WHERE "users"."id" = ?  [["money", 100], ["updated_at", "2015-06-06 13:15:52.234667"], ["id", 1]]
---
  def index
    @users = User.all
    if (params[:userid] and params[:money])
      User.find_by_userid(params[:userid]).update(:money => params[:money])

INSERT INTO "users" ("name", "pass", "aid", "money", "created_at", "updated_at") VALUES (?, ?, ?, ?, ?, ?)  [["name", "Ghanta Number 2"], ["pass", "Ghanta"], ["aid", "1000"], ["money", 1000], ["created_at", "2015-06-06 12:44:33.211140"], ["updated_at", "2015-06-06 12:44:33.211140"]]
---
  def create
    @user = User.new(user_params)

    respond_to do |format|
      if @user.save

UPDATE "users" SET "userid" = ?, "updated_at" = ? WHERE "users"."id" = ?  [["userid", 1000], ["updated_at", "2015-06-06 13:11:27.407314"], ["id", 1]]
---
  def update
    respond_to do |format|
      if @user.update(user_params)