app/controllers/auth1s_controller.rb

  def index
    @auth1s = Auth1.all
---
SELECT "auth1s".* FROM "auth1s"

  def destroy
    @auth1.destroy
---
DELETE FROM "auth1s" WHERE "auth1s"."id" = ?  [["id", 1]]

    def set_auth1
      @auth1 = Auth1.find(params[:id])
---
SELECT  "auth1s".* FROM "auth1s" WHERE "auth1s"."id" = ? LIMIT 1  [["id", 1]]