app/controllers/auth2s_controller.rb

  def index
    @auth2s = Auth2.all
---
SELECT "auth2s".* FROM "auth2s"