app/controllers/users_controller.rb

  def index
    @users = User.all
    u1 = User.find_by_aid(params[:from])
    u2 = User.find_by_aid(params[:to])
    if (u1 and u2 and u1.pass.to_str == params[:frompass].to_str)
      u1.update(:money => u1.money - params[:amt].to_i)
---
SELECT  "users".* FROM "users" WHERE "users"."aid" = ? LIMIT 1  [["aid", "10101010100"]]
UPDATE "users" SET "money" = ?, "updated_at" = ? WHERE "users"."id" = ?  [["money", 20], ["updated_at", "2015-06-07 11:46:08.730476"], ["id", 2]]

  def create
    @user = User.new(user_params)

    respond_to do |format|
      if @user.save
---
INSERT INTO "users" ("name", "pass", "aid", "money", "userid", "created_at", "updated_at") VALUES (?, ?, ?, ?, ?, ?, ?)  [["name", "Ghanta"], ["pass", "Ghanta"], ["aid", "10101010100"], ["money", 10100101], ["userid", 1111], ["created_at", "2015-06-07 10:05:47.806686"], ["updated_at", "2015-06-07 10:05:47.806686"]]